package oop.encapsulation;
// 🔹 Инкапсуляция - скрытие деталей
// 🔹Скрывать данные и управлять с доступом через private так же с методом getter setter
// 📌 Цель: защищать данные от внешнего вмешательства


// 🔹 Getter — метод, чтобы получить значение поля (чтение).
// 🔹 Setter — метод, чтобы установить значение поля (запись).
// 📌 Цель: контролировать доступ к полям объекта

public class Encapsulation {
    public static void main(String[] args) {
        System.out.println("Encapsulation");
    }
}
