package udemy.course;

// арифметические операторы часть 1

// | Оператор | Пример            | Описание                                         | Результат |
//| -------- | ----------------- | ------------------------------------------------ | --------- |
//| `+`      | `5 + 3`           | Сложение                                         | `8`       |
//| `-`      | `5 - 3`           | Вычитание                                        | `2`       |
//| `*`      | `5 * 3`           | Умножение                                        | `15`      |
//| `/`      | `5 / 2`           | Деление (целочисленное, если оба операнда `int`) | `2`       |
//| `/`      | `5.0 / 2`         | Деление с плавающей точкой (`double`)            | `2.5`     |
//| `%`      | `5 % 2`           | Остаток от деления                               | `1`       |
//| `++`     | `int a = 5; a++;` | Инкремент (увеличить на 1)                       | `a = 6`   |
//| `--`     | `int a = 5; a--;` | Декремент (уменьшить на 1)                       | `a = 4`   |

public class NinthLs {
    public static void main(String[] args) {

        int number = 10;

        int number1 = 9;

        int result = number / number1;
        System.out.println(result);


        // автосматическое конвертация

        double number2 = 10;
        double number3 = 9;

        double result1 = number2 / number3;

        System.out.println(result1);






    }
}
